In [2]:
import pandas as pd

# Load .csv file

In [31]:

ipl = pd.read_csv('matches.csv',nrows=5)
ipl

In [13]:
data = pd.read_csv(r'C:\Users\Shankar\Desktop\Data Science\work files\titanic_train.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
type(data)

pandas.core.frame.DataFrame

# Exporting data

In [19]:
data.to_csv(r'C:\Users\Shankar\Desktop\Data Science\titanic_train.csv')

In [15]:
import sys
data.to_csv(r'C:\Users\Shankar\Desktop\Data Science\titanic_train.csv', sep='@')

In [ ]:
data.to_csv(sys.stdout, na_rep='NULL')

In [24]:
data.to_csv(r'C:\Users\Shankar\Desktop\Data Science\titanic_train.csv', index=False, header=True)

# Pandas

# File Read operation

In [35]:

import pandas as pd

In [26]:
draft2 = pd.read_table(r'C:\Users\Shankar\Desktop\Data Science\Sample.tsv')  # Read a tsv into a DataFrame

draft2.head()

  Some parameter  Other parameter  Last parameter
0          CONST           123456           12.45

In [32]:
# Excel file

In [33]:
draft3 = pd.read_excel(r'C:\Users\Shankar\Desktop\Data Science\testfile.xlsx',sheetname='xyz') # Name of sheet to read from

draft3

C:\Users\Shankar\Anaconda3\lib\site-packages\pandas\io\excel.py:329: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  **kwds)

   Col1  Col2  Col3
0    10    15    20
1    20    25    30
2    30    35    40